//var keyScore = document.querySelectorAll('.score');
var allitems = `最近我總覺疲倦乏力，即使早上起床亦是這樣。
我重視規則，因為它們是良好的指引。
有太多不同的事情我都喜歡去做，令我不能決定該先做哪一件。
我大部分時間都覺得虛弱和疲倦。
我知道自己比別人傑出，所以不在乎別人怎麼想。
別人從來沒有充分賞識我所做的事情。
如果家人強迫我，我會生氣，並會抗拒做他們要我做的事。
別人在背後取笑我，談論我的做事方式或外表。
我通常會強烈批評那些令我厭煩的人。
我似乎沒有太多感受，有也絕少表露出來。
對我來說，走路時保持身體平衡是一大難事。
我很容易並很快就表露出我的感受。
過去我濫用藥物(或吸毒)的習慣，常常使我惹上很多麻煩。
有時候我對家人相當粗魯及尖酸刻薄。
今天稱心滿意的事情是不會長久的。
我是個很容易相處及順從別人的人。
我年少時常因觸犯校規而惹上很多麻煩。
我怕與別人親密地來往，因為擔心日後可能被他們嘲笑或羞辱。 
我好像總是會選擇一些日後會待我不好的朋友。
自小我就經常抱有悲哀的想法。
我喜歡與異性打情罵俏。
我的個性極為反覆，經常改變主意，又非常情緒化。
我從來沒有因喝酒而影響工作。
多年前起我開始覺得自己很失敗。
我常常無緣無故地感到內疚。
別人羨慕或妒忌我的才幹。
當可以選擇時，我情願獨自地做事。
我認為有必要嚴厲管束我家人的行為。
人們通常認為我是一個含蓄和嚴肅的人。
最近我開始有一種想亂擲東西或打爛東西的感覺。
我認為我是個很特別的人，值得別人特別留意我。
我常期望結交新朋友或認識更多人。
若有人批評我的過錯，我會立刻指出那人的一些錯處。
最近我在精神或肉體上垮下來了。
我常常放棄做事情，因我怕自己會做得不好。
我常常發洩心中怒氣，事後又為此而感到非常內疚。
我身體的某些部分經常會失去知覺。
我想做就去做，不會擔心給別人帶來的影響。
吸食毒品也許不明智，但過去我的確需要它。
我想我是個膽小和拘謹的人。
我曾因一時衝動而做了不少愚蠢的事，結果為我帶來很多麻煩。
別人侮辱我或令我尷尬，我是永不會寬恕或忘記的。
當有好的事情發生在我身上時，我通常會感到憂愁或緊張。
我現在大部分時間都感到極度憂鬱和悲傷。
我經常極力去取悅別人，即使我不喜歡那些人。
我對性的興趣總是比大部分人淡。 
事情出錯時，我總是傾向責怪自己。
很久以前我已決定了最好是少與別人接觸。
自小我就經常要提防那些試圖欺騙我的人。
我很討厭那些自以為很了不起，又常以為做事做得比我更好的人。
當事情變得沉悶時，我喜歡搞點氣氛。
我酗酒的問題給我和家人帶來不少麻煩。
懲罰從不能阻嚇我做想要做的事。
曾經有很多次，我無緣無故地覺得十分開心和興奮。
最近幾周以來，在全無特別原因的情況下我都覺得精疲力竭。
我已有一段時間感到十分內疚，因為我再不能把事情辦好。
我認為自己是個善於交際和性格外向的人。
最近幾個星期，我變得頗為神經過敏。
我清楚掌握自己的財政狀況，因此若有臨時急需，也能應付得來。
我就是缺少別人擁有的那份運氣。
有很多意念在我腦中轉來轉去，揮之不去。
過去一兩年間，我變得對生命失去信心和感到悲哀。
多年來，很多人一直在窺探我的私生活。
不知因何原因，我有時會說些尖酸刻薄的話，為的只是要使別人不高興。
去年我坐飛機越過大西洋有30次之多。
我濫用藥物的習慣，過去曾令我不能上班工作。
我有很多超時代的想法。
最近不知何故，我需把事情反反復復地思量。
我避開大部分的社交場合，因為我預料其他人會批評或不接受我。
我常常想，我不值得有好的事情發生在我身上。
獨自一人時，我常會感到有個看不見的人就在我身邊。
我感到漫無目的，不知自己生命朝向哪裏。
我經常容許別人替我作重要的決定。
我似乎無法睡眠，起床時跟上床時一樣累。
最近我常冒汗和覺得神經非常緊張。
我不停地有一些我希望可以擺脫的古怪思想。
我有很大困難控制自己過量飲酒的衝動。
即使是清醒時，我似乎也察覺不到我身邊的人。
我常發怒和發牢騷。
我很容易便結識到很多朋友。
我為自己年少時曾受到的一些虐待折磨而感到羞愧。
我時常確保自己的工作是經過精心策劃和組織的。
我的情緒在一兩天之間變化相當大。
我對自己太缺乏信心，因此不敢冒險嘗試新事物。
如果有人容許別人佔他便宜，我不會責怪那些佔他便宜的人。
我感到悲傷和抑鬱已有一段時間，現在仍不能振作過來。
我常常為那些做事慢吞吞的人而生氣。
在聚會中，我絕不會坐在一旁。
我密切注意家人的一舉一動，好使我知道誰可靠，誰不可靠。
有時我會因別人對我好而感到困惑和不快。
因我吸食毒品，導致家中常常起糾紛。
我大部分時間都是獨自一人，而我也喜歡這樣。
我有些家人說我自私，只替自己著想。
即使我以為已作了決定，別人仍很容易改變我的主意。
我常常因愛指揮他人做事而令他們生氣。
過去曾有人說，我對太多的事物興趣太濃和過分興奮。
我相信「早睡早起」是好的。
對於在我生命中重要的人，我對他們的感覺常會在愛與恨之間反復變化。
在社交聚會中，我幾乎總是非常自覺和緊張。
我看我會跟爸媽一樣，也會成為酒鬼。
我似乎沒有認真地承擔該負的家庭責任。
自小我便已經與現實世界脫節。
有些奸詐的人常想拿我所做或所想的事物去領功。
我不能感到快樂，因為我不覺得自己應該得到快樂。
我不渴望有親密的友誼。
我以往曾有多段日子，因為太過高興以及消耗過多體力，以致後來變得情緒低落。
我完全失去了食慾，晚上又經常失眠。
我十分擔憂會變成孤伶伶一個人，還須要自己照顧自己。
過去一段很不愉快的經歷，仍經常纏繞著我的思想。
去年我是數份雜誌的封面人物。
我似乎對大部分我以往喜歡做的事情都失去了興趣，例如性愛。
我自小就常常意志消沉和悲傷。
我曾經有幾次惹上官司。
避免犯錯的一個好方法，就是凡事都按既定方法而行。
別人常常用一些我沒有做過的事來責怪我。
我曾須用頗為強硬的手段去使某些人就範。
別人認為我有時會說一些古怪的或與別人很不同的東西。
曾經有段日子，我沒有毒品就無法過活。
別人嘗試使我相信自己是神經失常的。
我會不顧一切去阻止我所愛的人拋棄我。
我在一星期內會多次毫無節制地吃很多食物。
我好像總是把眼前的好機會弄得一團糟。
我總是難以消除自己沮喪和不快的感覺。
當我獨自一人在外（不在家）時，我便會開始感到緊張和驚慌。
別人有時會生我的氣，因為他們說我說話太多或說得太快。
現今大部分的成功人士，不是靠運氣就是曾經不誠實。
我不願與別人交往，除非我肯定他們會喜歡我。
我感到極度憂鬱，但卻找不出原因。
雖事隔多年，那件曾使我生命受威脅的事情仍會在惡夢中出現。
我再沒有精力去專心處理我的日常工作。
當我感到情緒低落時，喝酒會有點幫助。
我不願想及年幼時被人虐待的一些情景。
即使處於順境，我仍總是擔心事情會瞬即變壞。
我有時會因事情變壞而感到精神錯亂或虛幻不真。
獨自一人，身邊無人可依靠時，真會使我感到恐懼。
我知道我花了太多錢去買毒品。
我一向設法做到在完成了工作後，才會去消遣娛樂。
我可以看得出，在我所到之處，別人都在我背後談論我。
在遇上麻煩時，我善於找藉口脫身。
我相信有人正在密謀對付我。
我覺得大部分人都認為我很差勁。
我經常感到自己裏面什麼也沒有，好像我是虛空和空心的。
我有時在進食後會強迫自己把食物嘔吐出來。
我似乎過分要求別人去欣賞我所講或所做的事。
我的生活在擔心這樣或擔心那樣中度過。
當有人對我特別好時，我總會懷疑他的真正目的是什麼。
有一些思想總是不停地在我腦海中出現。
在生活裏沒有多少事物能使我開心。
過去一段痛苦的經歷，不停在我腦海中湧現，令我顫抖及無法入睡。
在每一天的開始，展望將要發生的事情，都會令我感到十分沮喪。
我始終無法擺脫「我是一個無用的人」的感覺。
我曾經嘗試，但始終沒法戒除酒癮。
有人一直想控制我的思想。
我曾嘗試自殺。
我願意節食，使自己比現在更瘦。
我不明白為何有些人對我微笑。
過去十年，我未見過一輛汽車。
與不太熟悉的人在一起，我會很緊張，因為他們可能會傷害我。
只有很突出的人，才可以了解我的特殊才能。
過去可怕的經歷，仍會在我腦海中突然出現，影響我現在的生活。
在與人相處時，我似乎常製造一些令自己受傷害或感到被排斥的情況。
我時常會沉醉在自己的思想中，連身邊正在發生什麼事都忘記了。
別人說我瘦，但我卻覺得我的大腿和臀圍過份肥大。
過去一些可怕的經歷，常反覆出現在我的腦海和夢境裏。
除家人外，我沒有好朋友。 
我通常會迅速行事，不會仔細想清楚應考慮到的問題。
我極力做到不讓別人知道我的私生活，免得有人佔我便宜。
我很多時因為聽覺太敏銳而感到煩惱。
當與別人意見不合時，我總會願意順從對方，因我怕他們會發怒或排斥我。
我反反復復地做某些行為，有時是為了減輕焦慮，亦有時是為了防止不好的事發生。
最近我曾認真考慮要自殺。
別人說我是個為人處事都非常循規蹈矩和很重視道德的人。
當我想起多年前一段慘痛的經歷，我仍會感到驚慌。
雖然我害怕去結識朋友，但我仍希望可以有更多朋友。
有些應該是我朋友的人想要傷害我。`
var allitemsDes = allitems.split("\n");

var sub1,sub2A,sub2B,sub3,sub4,sub5,sub6A,sub6B,sub7,sub8A,sub8B,subS,subC,subP,subA,subH,subN,subD,subB,subT,subR,subSS,subCC,subPP;
var totalSub;

function mcmigogogo(){
    document.querySelector('.choose').style='display:block';
    document.querySelector('.check').style='display:block';

    var scorearr=[];

    var data = document.querySelector('.score').value;
    var dataArr = data.split('\n'); // 轉成一個大陣列，共30個，因為原本有30排
    var dataArr2 = dataArr.map(el=>{  // 為了要解決原本表格中 某一行的間距不同 這個bug
        var index = dataArr.indexOf(el);
        if(index===2){ // 針對這一行特別處理
            return el.split('	 	')
        }else{
            return el.split('		')
        }
    });
    var dataArr3 = [];
    for(var i=0;i<30;i++){
        dataArr3[i] = dataArr2[i].map(el2=>(el2.split('.	'))[1])  // 得到一個單純只有值的arr
    }
    var finalArr = [];
    for(var k=0;k<6;k++){
        for(var j=0;j<30;j++){
            finalArr.push(dataArr3[j][k]);
        }
    }
    finalArr.splice(175,5);
    finalArr = finalArr.map(el=>parseInt(el)) // 把每一個字串轉數字
    scorearr = finalArr;
    //console.log(scorearr)

    var Item = function(num,des){
        this.num=num;
        this.des=des;
        this.val=(scorearr[this.num-1]); //因為t1其實是對應 第一項(array[0])
	};

    for(var i=1;i<176;i++){
        var newvart = "t" + i;
        window[newvart]=new Item(i,allitemsDes[i-1]);   // 用這個方式取代下面的做法
    }

/* 笨的作法
    t1 = new Item(1,'a1');
    t2 = new Item(2,'a2');
    t3 = new Item(3,'a3');
    t4 = new Item(4,'a4');
*/

    //檢驗的功能
    function eq1(el){ // 檢驗val=1
        if(el.val===1){
            return 1;
        }else{
            return 0;
        }
    }

    function eq2(el){ // 檢驗val=2
        if(el.val===2){
            return 1;
        }else{
            return 0;
        }
    }

    //最重要的part！把檢驗的值跟加權，都放進subscale的資訊裡面
    
    //sample
    //var subA = [[t1,t2,t4],[eq1(t1),eq2(t2),eq2(t4)],[1,2,2]];
    //var subB = [[t1,t3,t4],[eq2(t1),eq2(t3),eq2(t4)],[1,1,2]];
    
    /* sample
    var sub1 = [
        [], //
        [], //另外設定功能，轉出此行文字，然後再貼上
        [] //需要手動比對
    ]
    */

    sub1 = [
        [t4,t10,t27,t32,t38,t46,t48,t57,t92,t101,t105,t142,t148,t156,t165,t167], //16
        [eq1(t4),eq1(t10),eq1(t27),eq2(t32),eq1(t38),eq1(t46),eq1(t48),eq2(t57),eq1(t92),eq1(t101),eq1(t105),eq1(t142),eq1(t148),eq1(t156),eq1(t165),eq1(t167)], //另外設定功能，轉出此行文字，然後再貼上
        [1,2,2,1,1,2,1,1,2,1,2,1,2,1,2,1] //需要手動比對
    ]

    sub2A = [
        [t18,t40,t47,t48,t57,t69,t80,t84,t99,t127,t141,t146,t148,t151,t158,t174], //
        [eq1(t18),eq1(t40),eq1(t47),eq1(t48),eq2(t57),eq1(t69),eq2(t80),eq1(t84),eq1(t99),eq1(t127),eq1(t141),eq1(t146),eq1(t148),eq1(t151),eq1(t158),eq1(t174)], //另外設定功能，轉出此行文字，然後再貼上
        [2,2,1,1,1,2,1,2,2,2,2,1,1,1,1,2] //需要手動比對
    ]

    sub2B = [
        [t20,t24,t25,t43,t47,t83,t86,t112,t123,t133,t142,t145,t148,t151,t154], //
        [eq1(t20),eq1(t24),eq1(t25),eq1(t43),eq1(t47),eq1(t83),eq1(t86),eq1(t112),eq1(t123),eq1(t133),eq1(t142),eq1(t145),eq1(t148),eq1(t151),eq1(t154)], //另外設定功能，轉出此行文字，然後再貼上
        [2,1,2,1,2,1,1,2,2,2,1,2,1,2,1] //需要手動比對
    ]

    sub3 = [
        [t16,t35,t45,t47,t56,t73,t82,t84,t94,t108,t120,t133,t135,t141,t151,t169], 
        [eq1(t16),eq1(t35),eq1(t45),eq1(t47),eq1(t56),eq1(t73),eq2(t82),eq1(t84),eq1(t94),eq1(t108),eq1(t120),eq1(t133),eq1(t135),eq1(t141),eq1(t151),eq1(t169)], 
        [2,2,2,1,1,2,1,1,2,2,1,1,2,1,1,2]
    ]
    sub4 = [
        [t10,t12,t21,t24,t27,t32,t48,t51,t57,t69,t80,t88,t92,t99,t123,t127,t174], 
        [eq2(t10),eq1(t12),eq1(t21),eq2(t24),eq2(t27),eq1(t32),eq2(t48),eq1(t51),eq1(t57),eq2(t69),eq1(t80),eq1(t88),eq2(t92),eq2(t99),eq2(t123),eq2(t127),eq2(t174)], 
        [1,2,2,1,1,2,1,2,2,1,2,2,1,1,1,1,1]
    ]
    sub5 = [
        [t5,t21,t26,t31,t35,t38,t40,t47,t57,t67,t69,t80,t84,t85,t86,t88,t93,t94,t99,t116,t141,t144,t159,t169], 
        [eq1(t5),eq1(t21),eq1(t26),eq1(t31),eq2(t35),eq1(t38),eq2(t40),eq2(t47),eq1(t57),eq1(t67),eq2(t69),eq1(t80),eq2(t84),eq1(t85),eq2(t86),eq1(t88),eq1(t93),eq2(t94),eq2(t99),eq1(t116),eq2(t141),eq1(t144),eq1(t159),eq2(t169)], 
        [2,1,2,2,1,1,1,1,1,2,1,1,1,2,1,1,2,1,1,1,1,2,2,1]
    ]
    sub6A = [
        [t7,t13,t14,t17,t21,t38,t41,t52,t53,t93,t101,t113,t122,t136,t139,t166,t172], 
        [eq1(t7),eq1(t13),eq1(t14),eq1(t17),eq1(t21),eq1(t38),eq1(t41),eq1(t52),eq1(t53),eq1(t93),eq1(t101),eq1(t113),eq1(t122),eq1(t136),eq1(t139),eq1(t166),eq2(t172)], 
        [1,1,1,2,1,2,1,1,2,1,2,2,1,1,2,2,1]
    ]
    sub6B = [
        [t7,t9,t13,t14,t17,t28,t33,t36,t39,t41,t49,t53,t64,t79,t87,t93,t95,t96,t116,t166], 
        [eq1(t7),eq1(t9),eq1(t13),eq1(t14),eq1(t17),eq1(t28),eq1(t33),eq1(t36),eq1(t39),eq1(t41),eq1(t49),eq1(t53),eq1(t64),eq1(t79),eq1(t87),eq1(t93),eq1(t95),eq1(t96),eq1(t116),eq1(t166)], 
        [1,2,1,2,1,2,1,1,1,1,1,1,2,1,2,1,2,1,2,1]
    ]
    sub7 = [
        [t2,t7,t14,t22,t29,t41,t53,t59,t72,t82,t97,t101,t114,t137,t139,t166,t172], 
        [eq1(t2),eq2(t7),eq2(t14),eq2(t22),eq1(t29),eq2(t41),eq2(t53),eq1(t59),eq2(t72),eq1(t82),eq1(t97),eq2(t101),eq1(t114),eq1(t137),eq2(t139),eq2(t166),eq1(t172)], 
        [2,1,1,1,2,1,1,2,1,2,2,1,2,2,1,1,2]
    ]
    sub8A = [
        [t6,t7,t15,t22,t36,t42,t50,t60,t79,t83,t98,t115,t122,t126,t133,t166], 
        [eq1(t6),eq1(t7),eq1(t15),eq1(t22),eq1(t36),eq1(t42),eq1(t50),eq1(t60),eq1(t79),eq1(t83),eq1(t98),eq1(t115),eq1(t122),eq1(t126),eq1(t133),eq1(t166)], 
        [1,2,2,2,2,1,2,2,2,1,1,2,1,2,1,1]
    ]
    sub8B = [
        [t18,t19,t24,t25,t35,t40,t43,t70,t90,t98,t104,t122,t148,t161,t169], 
        [eq1(t18),eq1(t19),eq1(t24),eq1(t25),eq1(t35),eq1(t40),eq1(t43),eq1(t70),eq1(t90),eq1(t98),eq1(t104),eq1(t122),eq1(t148),eq1(t161),eq1(t169)], 
        [1,2,1,1,1,1,2,2,2,1,2,2,1,2,1]
    ]
    subS = [
        [t8,t48,t69,t71,t76,t99,t102,t117,t134,t138,t141,t148,t151,t156,t158,t162], 
        [eq1(t8),eq1(t48),eq1(t69),eq1(t71),eq1(t76),eq1(t99),eq1(t102),eq1(t117),eq1(t134),eq1(t138),eq1(t141),eq1(t148),eq1(t151),eq1(t156),eq1(t158),eq1(t162)], 
        [2,2,1,2,2,1,1,2,1,2,1,1,1,2,2,2]
    ]
    subC = [
        [t7,t22,t30,t41,t72,t83,t98,t120,t122,t134,t135,t142,t154,t161,t166,t171], 
        [eq1(t7),eq1(t22),eq1(t30),eq1(t41),eq1(t72),eq1(t83),eq1(t98),eq1(t120),eq1(t122),eq1(t134),eq1(t135),eq1(t142),eq1(t154),eq1(t161),eq1(t166),eq1(t171)], 
        [1,1,2,2,2,2,2,2,1,2,1,2,2,1,1,1]
    ]
    subP = [
        [t6,t8,t33,t42,t48,t49,t60,t63,t89,t103,t115,t138,t146,t158,t159,t167,t175], 
        [eq1(t6),eq1(t8),eq1(t33),eq1(t42),eq1(t48),eq1(t49),eq1(t60),eq1(t63),eq1(t89),eq1(t103),eq1(t115),eq1(t138),eq1(t146),eq1(t158),eq1(t159),eq1(t167),eq1(t175)], 
        [2,1,2,2,1,2,1,1,2,2,1,1,2,1,1,2,2]
    ]
    subA = [
        [t40,t58,t61,t75,t76,t108,t109,t124,t135,t145,t147,t149,t164,t170], 
        [eq1(t40),eq1(t58),eq1(t61),eq1(t75),eq1(t76),eq1(t108),eq1(t109),eq1(t124),eq1(t135),eq1(t145),eq1(t147),eq1(t149),eq1(t164),eq1(t170)], 
        [1,2,1,2,1,1,1,2,1,1,2,1,2,2]
    ]
    subH = [
        [t1,t4,t11,t37,t55,t74,t75,t107,t111,t130,t145,t148], 
        [eq1(t1),eq1(t4),eq1(t11),eq1(t37),eq1(t55),eq1(t74),eq1(t75),eq1(t107),eq1(t111),eq1(t130),eq1(t145),eq1(t148)], 
        [1,2,2,2,2,2,1,1,1,1,1,1]
    ]
    subN = [
        [t3,t22,t41,t51,t54,t83,t96,t106,t117,t125,t134,t166,t170], 
        [eq1(t3),eq1(t22),eq1(t41),eq1(t51),eq1(t54),eq1(t83),eq1(t96),eq1(t106),eq1(t117),eq1(t125),eq1(t134),eq1(t166),eq1(t170)], 
        [2,1,1,1,2,1,2,2,1,2,1,1,1]
    ]
    subD = [
        [t15,t24,t25,t55,t56,t62,t83,t86,t104,t111,t130,t141,t142,t148], 
        [eq1(t15),eq1(t24),eq1(t25),eq1(t55),eq1(t56),eq1(t62),eq1(t83),eq1(t86),eq1(t104),eq1(t111),eq1(t130),eq1(t141),eq1(t142),eq1(t148)], 
        [1,2,1,1,2,2,1,2,1,2,2,1,1,1]
    ]
    subB = [
        [t14,t23,t41,t52,t64,t77,t93,t100,t101,t113,t122,t131,t139,t152,t166], 
        [eq1(t14),eq2(t23),eq1(t41),eq1(t52),eq1(t64),eq1(t77),eq1(t93),eq1(t100),eq1(t101),eq1(t113),eq1(t122),eq1(t131),eq1(t139),eq1(t152),eq1(t166)], 
        [1,2,1,2,1,2,1,2,1,1,1,2,1,2,1]
    ]
    subT = [
        [t7,t13,t21,t38,t39,t41,t53,t66,t91,t101,t113,t118,t136,t139], 
        [eq1(t7),eq1(t13),eq1(t21),eq1(t38),eq1(t39),eq1(t41),eq1(t53),eq1(t66),eq1(t91),eq1(t101),eq1(t113),eq1(t118),eq1(t136),eq1(t139)],
        [1,2,1,1,2,1,1,2,2,1,1,2,2,1] 
    ]
    subR = [
        [t62,t76,t83,t109,t123,t129,t133,t142,t147,t148,t149,t151,t154,t160,t164,t173], 
        [eq1(t62),eq1(t76),eq1(t83),eq1(t109),eq1(t123),eq1(t129),eq1(t133),eq1(t142),eq1(t147),eq1(t148),eq1(t149),eq1(t151),eq1(t154),eq1(t160),eq1(t164),eq1(t173)],
        [1,1,1,2,1,2,1,1,1,1,2,1,1,2,1,2] 
    ]
    subSS = [
        [t22,t34,t56,t61,t68,t72,t76,t78,t83,t102,t117,t134,t142,t148,t151,t162,t168], 
        [eq1(t22),eq1(t34),eq1(t56),eq1(t61),eq1(t68),eq1(t72),eq1(t76),eq1(t78),eq1(t83),eq1(t102),eq1(t117),eq1(t134),eq1(t142),eq1(t148),eq1(t151),eq1(t162),eq1(t168)],
        [1,2,1,2,2,1,1,2,1,2,1,1,1,1,1,1,2] 
    ]
    subCC = [
        [t1,t4,t34,t44,t55,t74,t104,t107,t111,t128,t130,t142,t148,t149,t150,t154,t171], 
        [eq1(t1),eq1(t4),eq1(t34),eq1(t44),eq1(t55),eq1(t74),eq1(t104),eq1(t107),eq1(t111),eq1(t128),eq1(t130),eq1(t142),eq1(t148),eq1(t149),eq1(t150),eq1(t154),eq1(t171)],
        [2,1,1,2,1,1,1,2,1,2,1,1,1,1,2,1,2] 
    ]
    subPP = [
        [t5,t38,t49,t63,t67,t89,t103,t119,t138,t140,t153,t159,t175], 
        [eq1(t5),eq1(t38),eq1(t49),eq1(t63),eq1(t67),eq1(t89),eq1(t103),eq1(t119),eq1(t138),eq1(t140),eq1(t153),eq1(t159),eq1(t175)],
        [1,1,1,2,1,1,1,2,1,2,2,1,1] 
    ]

    //全部的向度in arr
    totalSub = [sub1,sub2A,sub2B,sub3,sub4,sub5,sub6A,sub6B,sub7,sub8A,sub8B,subS,subC,subP,subA,subH,subN,subD,subB,subT,subR,subSS,subCC,subPP];


    //顯示總分
    var sumtext=`        
    <table>
    <tr>
        <th>向度</th>
        <th>總分</th>
    </tr>`;;
    for(var i=0;i<totalSub.length;i++){
        //console.log(menubtn[i+1].textContent+''+sum(totalSub[i]))
        sumtext += `
        <tr>
        <td>${menubtn[i+1].textContent}</td>
        <td>${sum(totalSub[i])}</td>
        </tr>
        ` 
        //`${menubtn[i+1].textContent}  ${sum(totalSub[i])}<br>`
    }
    document.querySelector('.RawScore').innerHTML=sumtext;

    //check 題數
    var count=0;
    for(var z=0;z<scorearr.length;z++){
        if (scorearr[z]!==1 && scorearr[z]!==2 && scorearr[z]!==3) {
            count +=1;
        }
    }
    document.querySelector('.TotalItems').innerHTML=175-count;


}

var menu = document.querySelector('.menu');
var menubtn = menu.querySelectorAll('button');
menubtn.forEach(el=>{
    el.addEventListener('click',()=>{
        var indexnum;
        for(var i=0;i<menubtn.length;i++){
            if(menubtn[i]===el){
                indexnum =i;
                break;
            }
        }

        if(indexnum!==0){
            document.querySelector('.display').style='display:block';
            document.querySelector('.workboard').style='display:none';
            document.querySelector('.subname').textContent=el.textContent;
            display(totalSub[indexnum-1]);
        }else{
            document.querySelector('.display').style='display:none';
            document.querySelector('.workboard').style='display:block';
        }

        //console.log(indexnum)
        //console.log(totalSub[indexnum-1])
    })
})


//該向度中，有得分的題目就show出來
function display(el){
    var fitpart = `        
        <table>
        <tr>
            <th>題號</th>
            <th>題目</th>
            <th>權重</th>
            <th>答案</th>
        </tr>`;
    var notfitpart = `        
        <table>
        <tr>
            <th>題號</th>
            <th>題目</th>
            <th>權重</th>
            <th>答案</th>
        </tr>`;

    for(var j=0;j<el[0].length;j++){
        if(el[1][j]===1){ //符合
            //fitpart += `${el[0][j].num} ${el[0][j].des} <br>`
            //console.log(el[0][j].num+' '+el[0][j].des)
            fitpart += `
            <tr>
            <td>${el[0][j].num}</td>
            <td>${el[0][j].des}</td>
            <td>${el[2][j]}</td>
            <td>${(el[0][j].val===1)?'是':'否'}</td>
            </tr>
            ` 
        }else{ //不符合
            //notfitpart += `${el[0][j].num} ${el[0][j].des} <br>`
            notfitpart += `
            <tr>
            <td>${el[0][j].num}</td>
            <td>${el[0][j].des}</td>
            <td>${el[2][j]}</td>
            <td>${(el[0][j].val===1)?'是':'否'}</td>
            </tr>
            ` 
        }
    }
    document.querySelector('.fititems').innerHTML = fitpart;
    document.querySelector('.nofititems').innerHTML = notfitpart;
}

//總分
function sum(el){
    var totalscore=0;
    for(var i=0;i<el[0].length;i++){
        totalscore+=(el[1][i]*el[2][i]);
    }
    return totalscore;
}

